# frozen_string_literal: true

brew 'awscli'
brew 'chruby'
brew 'chruby-fish'
brew 'coreutils'

# min. 3.2.0 gegen https://github.com/fish-shell/fish-shell/pull/7365
brew 'fish'

brew 'git'
brew 'gnupg'
brew 'iperf'
brew 'jq'
brew 'mysql-connector-c'
brew 'mysql-client'
brew 'netcat'
brew 'node'
brew 'pwgen'
brew 'reattach-to-user-namespace'
brew 'ruby-install'
brew 'ripgrep'
brew 'telnet'
brew 'terraform'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'

# brew tap caskroom/cask
# brew tap caskroom/versions

# Previously but not actually used software installed with Homebrew:
#   cowsay, dos2unix, fswatch, graphviz, htop-osx,
#   jemalloc, memcached, ntfs-3g, s3cmd, terminal-notifier, unison

# brew cask install karabiner-elements
# brew cask install hammerspoon
# brew cask install iterm2

# brew tap caskroom/fonts
# brew cask install font-bitstreamverasansmono-nerd-font-mono

# TODO: Existing installations mergeable?

cask 'bitbar'
cask 'bitwarden'
cask 'cyberduck'
# cask 'dash'
cask 'docker'
cask 'gimp'
cask 'google-chrome'
cask 'hammerspoon'
cask 'karabiner-elements'
# cask 'macvim'
cask 'mysqlworkbench'
cask 'p4v' # P4Merge
cask 'sequel-pro'
cask 'signal'
cask 'sourcetree'
cask 'spotify'
cask 'veracrypt'
cask 'wireshark'
